apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Classes/AppleUSBUHCI_UIM.cpp
    /* Now add to endpoint and controller active queue and mark active. */
    clock_get_uptime(&tp->timestamp);
    clock_get_uptime(&tp->endpoint->timestamp);
    tp->state = kUHCI_TP_STATE_ACTIVE;
    queue_enter(&_activeTransactions, tp, UHCITransaction *, active_chain);
    queue_enter(&tp->endpoint->activeTransactions, tp, UHCITransaction *, endpoint_chain);
    
    //DumpTransaction(tp, 5);
    //DumpFrame(ReadFrameNumber() % kUHCI_NVFRAMES, 6);
    DumpEndpoint(ep, 7);
    USBLog(7, "%s[%p]::StartTransaction %p done", getName(), this, tp);
}



/* Remove a transaction from the schedule. */
void
AppleUSBUHCI::RemoveTransaction(UHCITransaction *tp)
{
    UHCIEndpoint *ep;
    UHCITransaction *last_tp, *next_tp;
    TD *td;
        
    USBLog(7, "%s[%p]::RemoveTransaction %p", getName(), this, tp);
    ep = tp->endpoint;
    
    DumpEndpoint(ep, 7);
    
    if (tp == (UHCITransaction *)queue_first(&ep->activeTransactions)) {
        /* This was the first transaction on the endpoint's active queue. */
        last_tp = NULL;
        assert(tp == (UHCITransaction *)queue_prev(&tp->endpoint_chain));
    } else {
        /* Get the previous transaction's qh on the endpoint. */
        last_tp = (UHCITransaction *)queue_prev(&tp->endpoint_chain);
    }
    next_tp = (UHCITransaction *)queue_next(&tp->endpoint_chain);
    if (next_tp == tp) {
        next_tp = NULL;
    }
    USBLog(7, "%s[%p]::RemoveTransaction last_tp = %p", getName(), this, last_tp);
    
    /* Remove from endpoint and controller active queue. */
    queue_remove(&ep->activeTransactions, tp, UHCITransaction *, endpoint_chain);
    queue_remove(&_activeTransactions, tp, UHCITransaction *, active_chain);
    
    if (tp->type == kUSBIsoc) {
        TD **isoc_tds;
        unsigned int i, frame;
        
        // Don't actually remove the TDs from the schedule;
        // just turn off the ACTIVE and IOC bit in all the TDs.
        USBLog(7, "%s[%p]: disabling ACTIVE on isoc tp %p", getName(), this, tp);
        isoc_tds = ep->isoc_tds;
        frame = tp->isoc_start_frame;
        for (i=0; i < tp->isoc_num_frames; i++) {
            td = isoc_tds[frame];
            //USBLog(7, "%s[%p]: %d disabling ACTIVE and IOC bit on td %p", getName(), this, i, td);
            td->fllp = NULL;
            td->hw.ctrlStatus &= HostToUSBLong(~(kUHCI_TD_IOC | kUHCI_TD_ACTIVE));
            IOSync();
            frame++;
            if (frame >= kUHCI_NVFRAMES) {
                frame = 0;
            }
        }
    } else {
        /* Set previous queue's vertical next to this queue's vertical next. */
        
        if (last_tp == NULL) {
            /* This was the first transaction on the queue. */
            USBLog(7, "%s[%p]:: setting qlink %p, elink %p, hw.elink %p", getName(), this,
                   tp->qh->qlink, tp->qh->elink, tp->last_td->hw.link);
            ep->head_qh->elink = NULL;
            ep->head_qh->hw.elink = tp->last_td->hw.link;
        } else {
            /* This transaction was not the first on the queue. */
            last_tp->last_td->hw.link = tp->last_td->hw.link;
            IOSync();
        }
        if (next_tp == NULL) {
            ep->head_qh->hw.elink = HostToUSBLong(kUHCI_QH_T);
        } else {
            if (ep->head_qh->hw.elink == HostToUSBLong(tp->qh->paddr)) {
                ep->head_qh->hw.elink = tp->last_td->hw.link;
                // This should be the same as next_tp->qh->paddr
            }
        }
        IOSync();
        
        /* Set my vertical next to null. */
        //tp->qh->elink = NULL; // XXX leave for debugging
        //tp->qh->qlink = NULL;
        tp->qh->hw.elink = HostToUSBLong(kUHCI_QH_T);
        assert(tp->last_td != NULL);
        tp->last_td->hw.link = HostToUSBLong(kUHCI_TD_T);
        IOSync();
    }

    DumpEndpoint(ep, 7);
    USBLog(7, "%s[%p]::RemoveTransaction %p done", getName(), this, tp);
}

/* Completion for isochronous transactions. */

void 
AppleUSBUHCI::CompleteIsoc(IOUSBIsocCompletion      completion,
                           IOReturn                 status,
                           void *                   pFrames)
{
    IOUSBIsocCompletionAction action;

    USBLog(6, "%s[%p]::CompleteIsoc status %d (%s) parameter %x pframes %p", getName(), this,
           status, USBErrorToString(status), completion.parameter, pFrames);
    if (completion.action) {
        action = completion.action;
        completion.action = NULL;
        (*action)(completion.target,
                  completion.parameter,
                  status,
                  (IOUSBIsocFrame *)pFrames);
    } else {
        USBLog(2, "%s[%p]:CompleteIsoc has no action!!", getName(), this);
    }
}


/* Completes a transaction with the upper layers.
 */

void
AppleUSBUHCI::CompleteTransaction(UHCITransaction *tp, IOReturn returnCode )
{
    UHCIEndpoint *ep;
    IOReturn result, isoc_result;
    unsigned int i, count, frame;
    UInt32 length, total_length, req_length;
    AbsoluteTime currentTime, delta;
    TD *td;
    UInt32 status, td_status, token, pid;
    IOUSBIsocFrame *fp = (IOUSBIsocFrame *)tp->isoc_frames;
    IOUSBLowLatencyIsocFrame *fllp = (IOUSBLowLatencyIsocFrame *)tp->isoc_frames;
    bool lowLatency = tp->isoc_low_latency;
    UHCIAlignmentBuffer *bp;
    bool needsReset = false;

    USBLog(7, "%s[%p]::CompleteTransaction(%p, %d)", getName(), this, tp, returnCode);
    DumpTransaction(tp, 7);
    
    /* This counts as activity on the endpoint. */
    clock_get_uptime (&currentTime);
    tp->endpoint->timestamp = currentTime;
    
    ep = tp->endpoint;
    isoc_result = kIOReturnSuccess;
    total_length = 0;
    status = 0;
    i = 0;
    
    if (tp->type == kUSBIsoc) {
        TD **isoc_tds = ep->isoc_tds;
        
        // add one millisecond per frame
        nanoseconds_to_absolutetime(NANOSECOND_TO_MILLISECOND, &delta);
        
        // XXX should take timestamp of last frame instead of current time
        
        /* The frames are not linked by the td->link chain.
         * Look through them one by one in the array.
         */
        for (i=0, frame = tp->isoc_start_frame; i<tp->isoc_num_frames; i++) {
            td = isoc_tds[frame];
            
            status = USBToHostLong(td->hw.ctrlStatus);
            token = USBToHostLong(td->hw.token);
            length = UHCI_TD_GET_ACTLEN(status);
            USBLog(6, "%s[%p]: first isoc td %p frame %d length %d", getName(), this, td, frame, length);
            
